# დაწერეთ პროგრამა, რომელიც დაბეჭდავს გამრავლების ტაბულას 1 და 9 ის ჩათვლით. ტაბულა უნდა იყოს სვეტებად შედგენილი. ყოველ მომდევნო სვეტში არ უნდა იყოს გამეორებული ნამრავლი წინა სვეტიდან. 

"""
Output:
1 * 1 = 1  
1 * 2 = 2  2 * 2 = 4  
1 * 3 = 3  2 * 3 = 6  3 * 3 = 9  
1 * 4 = 4  2 * 4 = 8  3 * 4 = 12  4 * 4 = 16  
...

"""

# რადგან ერთ ხაზზე პირველი რიცხვი (multiplier) იცვლება, ხოლო მეორე რიცხვი (multiplicand) უცვლელი რჩება, ამიტომ ვიფიქრე, უკეთესი იქნებოდა, თუ მათ ადგილებს გავუცვლიდი და outer loop-ზე multiplicand იქნებოდა, ხოლო inner loop-ზე multiplier. არ ვიცი, რამდენად სწორი მიდგომაა, სიმართლე გითხრათ, თავადაც გამიკვირდა ის რომ დაიბეჭდა, რაც მჭირდებოდა. 

for multiplicand in range(1, 10):
    for multiplier in range(1, multiplicand + 1):
        product = multiplier * multiplicand
        print(f"{multiplier} * {multiplicand} = {product}", end="  ")
    print()
